index.org
#+TITLE:data inventory 
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----

* COMMENT publish-code
#+name:publish
#+begin_src sh :session *shell* :tangle no :exports none :reports none :eval yes
#### name:publish####
mv index.html static/index.html
#+end_src

#+RESULTS: publish

* COMMENT todo list
> drv <- dbDriver("SQLite")
> tfile <- tempfile()
> con <- dbConnect(drv, dbname = "~/pitch.sqlite")
> dbListTables(con)
character(0)
> dbListTables(con)
character(0)
> con <- dbConnect(drv, dbname = "/home/ivan_hanigan/tools/web2py/applications/pitch/databases/storage.sqlite")
> dbListTables(con)
[1] "auth_cas"        "auth_event"      "auth_group"      "auth_membership"
[5] "auth_permission" "auth_user"       "post"            "sqlite_sequence"
> dbGetQuery(con , "select * from post")
  id  con user_id
1  1 asdf       1
2  2 asdf       2
3  3   hi       1
> dbGetQuery(con , "select * from post")
  id                 con user_id
1  1                asdf       1
2  2                asdf       2
3  3                  hi       1
4  4 this is a testing 1       2
> 

* COMMENT Init
** COMMENT torun-code
#+name:torun
#+begin_src sh :session *shell* :tangle no :exports none :eval no
#### name:torun####
# - include the server config: 
python ~/tools/web2py/web2py.py -a xpassword -i 0.0.0.0 -p 8181
#+end_src

** COMMENT README.md-code
#+name:README.md
#+begin_src R :session *R* :tangle README.md :exports none :eval no
#### Data Inventory

A web2py app to help manage research data

#+end_src
* Introduction
- There is a need for a data inventory tool to enable ecological data collections to be managed more efficiently
- The Ecological Metadata Language (EML) provides an excellent standardised schema for metadata, but the associated software Morpho does not have the flexibility or extensibility that would enable a data manager to use it to manage large and heterogeneous data collections
- This article describes an approach to use a relational database with web-based forms (using the web2py framework) and SQL helper functions (written in the R language) 
* EML
- the schema is defined at xxx
- We follow the LTER descriptions of best practice "~/references/LTER - Unknown - Introduction What is EML.pdf"
- the schematic below shows the structure of a minimally adequate EML XML document (closing tags omitted)
- We added some things like metadataProvider, but this is optional
#+begin_src R :session *R* :tangle no :exports reports :eval no
    <eml>
        <dataset>
#            <title>
#            <creator> 
#            <contact> 
            <project> 
                <title> 
                <personnel>
                <role>
                <abstract>
                <funding>
                <studyAreaDescription>
                <designDescription>
#            <publisher>
            <pubDate>
            <keywords>
            <abstract> 
#            <intellectualRights>
            <methods> 
            <coverage>
            <dataTable>
                <entityName>
                <entityDescription>                
                <physical>
                <attributeList>
        <additionalMetadata>
            <additionalLinks>
  
#+end_src
** The parts of an EML document 
- In EML, the term dataset is applied to a document which may contain
  general information such as the title, creator, and contacts,
  abstract and keywords as well as one or more data entities, such as
  datatables, that provide more specific research details.
- The information is at the level of a particular data collection or
  study, however there is also a level above this at the "project"
  level where research studies can be grouped together.
- [TODO] Remember that, “In EML, the term dataset refers to one or more data
  entities.” There is no generally accepted practice on what to
  include in an EML-dataset document. Some people will choose to have
  a one-to-one correspondence between an EML document and a data
  entity and a single physical file. Others will document several data
  entities in one dataset document. 
- Below is a brief description of the way we interpret the EML parts

*** Datasets
- Dataset is the top level of the EML.  The miminum necessary to
  proeduce a valid EML document is <title>, <creator>, <contract>.
  But one can't tell very much  with just a title and a name.  
- Our aim is to create an EML document that contains enough
  information about the data and research to make funding agencies
  happy and give other ecologists something to work with
*** Projects
- The optional <project> module provides an overall description of the
  larger-scale project or research context with which that dataset is
  associated.  For  example it might be an Longterm Ecological Research Network (LTER) site.
*** Datatables  
- As stated earlier, a dataset consists of one or more data entities,
  and the most common data entity is a <dataTable>. A data table is
  something that looks like a matrix with rows for observations and
  columns for variables
- [TODO] In addition to datatables, people using database applications may
  also produce a <view> from a database management system or a
  <storedProcedure> that results in data output. People using GIS
  (geographical information system) applications generate both
  <spatialVector>, also referred to as boundary or shape files, and
  <spatialRaster>. A <spatialRaster> is a geo-referenced image usually
  produced by a camera on a satellite or other remote sensing
  device. The final kind of data entity is <otherEntity>. An
  <otherEntity> is a data entity that cannot be represented by any of
  the previously defined data entity structures. A non-geo-referenced
  photograph is an <otherEntity>, e.g., a photograph of two different
  types of butterflies.


*** Attributes
- An attribute or as it is sometime referred to, variable, in this
  context refers to the name of the column of a datatable
- This is where Morpho and other EML tools come into their own.  Our
  database solution might be useful as an initial stage of data
  documentation, to be further refined using specialised EML tools

* web2py 
