static/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>data inventory </title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="data inventory "/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-02-08T14:04+1100"/>
<meta name="author" content="Ivan Hanigan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">data inventory </h1>


<hr/>







<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 EML</a>
<ul>
<li><a href="#sec-2-1">2.1 The parts of an EML document</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 Datasets</a></li>
<li><a href="#sec-2-1-2">2.1.2 Projects</a></li>
<li><a href="#sec-2-1-3">2.1.3 Datatables</a></li>
<li><a href="#sec-2-1-4">2.1.4 Attributes</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 web2py</a>
<ul>
<li><a href="#sec-3-1">3.1 set up web2py</a></li>
<li><a href="#sec-3-2">3.2 the web2py database example</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Design the database and interface</a>
<ul>
<li><a href="#sec-4-1">4.1 Create a new database</a></li>
<li><a href="#sec-4-2">4.2 Create a new web2py application</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Set up database tables</a>
<ul>
<li><a href="#sec-5-1">5.1 relational model</a></li>
<li><a href="#sec-5-2">5.2 defaults for models/db.py</a></li>
<li><a href="#sec-5-3">5.3 define our tables</a></li>
<li><a href="#sec-5-4">5.4 eml/title</a></li>
<li><a href="#sec-5-5">5.5 dataset</a></li>
<li><a href="#sec-5-6">5.6 old dataset</a></li>
<li><a href="#sec-5-7">5.7 datatable</a></li>
<li><a href="#sec-5-8">5.8 attribute</a></li>
<li><a href="#sec-5-9">5.9 accessor</a></li>
<li><a href="#sec-5-10">5.10 access</a></li>
<li><a href="#sec-5-11">5.11 keywords</a></li>
<li><a href="#sec-5-12">5.12 checklists</a></li>
<li><a href="#sec-5-13">5.13 deeds</a></li>
<li><a href="#sec-5-14">5.14 errata and addenda</a></li>
<li><a href="#sec-5-15">5.15 Defaults for controllers/default.py</a></li>
<li><a href="#sec-5-16">5.16 Top Menu And Register Accessors</a></li>
<li><a href="#sec-5-17">5.17 Access a dataset</a></li>
<li><a href="#sec-5-18">5.18 Register access view</a></li>
<li><a href="#sec-5-19">5.19 Main form ties it all together</a></li>
<li><a href="#sec-5-20">5.20 Form to manage all datasets</a></li>
<li><a href="#sec-5-21">5.21 finesse the interface</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>There is a need for a data inventory tool to enable ecological data collections to be managed more efficiently
</li>
<li>The Ecological Metadata Language (EML) provides an excellent standardised schema for metadata, but the associated software Morpho does not have the flexibility or extensibility that would enable a data manager to use it to manage large and heterogeneous data collections
</li>
<li>This article describes an approach to use a relational database with web-based forms (using the web2py framework) and SQL helper functions (written in the R language) 
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> EML</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>the schema is defined at xxx
</li>
<li>We follow the LTER descriptions of best practice "~/references/LTER - Unknown - Introduction What is EML.pdf"
</li>
<li>the schematic below shows the structure of a minimally adequate EML XML document (closing tags omitted)
</li>
<li>We added some things like metadataProvider, but this is optional
</li>
</ul>




<pre class="src src-R">&lt;eml&gt;
    &lt;dataset&gt;
        &lt;title&gt;
        &lt;creator&gt; 
        &lt;contact&gt; 
        &lt;project&gt; 
            &lt;title&gt; 
            &lt;personnel&gt;
            &lt;role&gt;
            &lt;abstract&gt;
            &lt;funding&gt;
            &lt;studyAreaDescription&gt;
            &lt;designDescription&gt;
        &lt;publisher&gt;
        &lt;pubDate&gt;
        &lt;keywords&gt;
        &lt;abstract&gt; 
        &lt;intellectualRights&gt;
        &lt;methods&gt; 
        &lt;coverage&gt;
        &lt;dataTable&gt;
            &lt;entityName&gt;
            &lt;entityDescription&gt;                
            &lt;physical&gt;
            &lt;attributeList&gt;
    &lt;additionalMetadata&gt;
        &lt;additionalLinks&gt;
  
</pre>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The parts of an EML document</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>In EML, the term dataset is applied to a document which may contain
  general information such as the title, creator, and contacts,
  abstract and keywords as well as one or more data entities, such as
  datatables, that provide more specific research details.
</li>
<li>The information is at the level of a particular data collection or
  study, however there is also a level above this at the "project"
  level where research studies can be grouped together.
</li>
<li>[TODO] Remember that, “In EML, the term dataset refers to one or more data
  entities.” There is no generally accepted practice on what to
  include in an EML-dataset document. Some people will choose to have
  a one-to-one correspondence between an EML document and a data
  entity and a single physical file. Others will document several data
  entities in one dataset document. 
</li>
<li>Below is a brief description of the way we interpret the EML parts
</li>
</ul>



</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Datasets</h4>
<div class="outline-text-4" id="text-2-1-1">

<ul>
<li>Dataset is the top level of the EML.  The miminum necessary to
  proeduce a valid EML document is &lt;title&gt;, &lt;creator&gt;, &lt;contract&gt;.
  But one can't tell very much  with just a title and a name.  
</li>
<li>Our aim is to create an EML document that contains enough
  information about the data and research to make funding agencies
  happy and give other ecologists something to work with
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Projects</h4>
<div class="outline-text-4" id="text-2-1-2">

<ul>
<li>The optional &lt;project&gt; module provides an overall description of the
  larger-scale project or research context with which that dataset is
  associated.  For  example it might be an Longterm Ecological Research Network (LTER) site.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Datatables</h4>
<div class="outline-text-4" id="text-2-1-3">

<ul>
<li>As stated earlier, a dataset consists of one or more data entities,
  and the most common data entity is a &lt;dataTable&gt;. A data table is
  something that looks like a matrix with rows for observations and
  columns for variables
</li>
<li>[TODO] In addition to datatables, people using database applications may
  also produce a &lt;view&gt; from a database management system or a
  &lt;storedProcedure&gt; that results in data output. People using GIS
  (geographical information system) applications generate both
  &lt;spatialVector&gt;, also referred to as boundary or shape files, and
  &lt;spatialRaster&gt;. A &lt;spatialRaster&gt; is a geo-referenced image usually
  produced by a camera on a satellite or other remote sensing
  device. The final kind of data entity is &lt;otherEntity&gt;. An
  &lt;otherEntity&gt; is a data entity that cannot be represented by any of
  the previously defined data entity structures. A non-geo-referenced
  photograph is an &lt;otherEntity&gt;, e.g., a photograph of two different
  types of butterflies.
</li>
</ul>



</div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Attributes</h4>
<div class="outline-text-4" id="text-2-1-4">

<ul>
<li>An attribute or as it is sometime referred to, variable, in this
  context refers to the name of the column of a datatable
</li>
<li>This is where Morpho and other EML tools come into their own.  Our
  database solution might be useful as an initial stage of data
  documentation, to be further refined using specialised EML tools
</li>
</ul>


</div>
</div>
</div>

</div>
