static/index.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> web2py</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> set up web2py</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>Web2py comes packaged up with everything it needs to run on a system (just needs python)
</li>
<li>run this using:
</li>
</ul>




<pre class="src src-sh"><span style="color: #586e75;">#### </span><span style="color: #586e75;">Code:</span>
    python ~/tools/web2py/web2py.py -a xpassword -i 0.0.0.0 -p 8181
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> the web2py database example</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li>once the web server is running the example can be visited at this link:
</li>
<li><a href="http://127.0.0.1:8181/examples/default/examples#database\_examples">http://127.0.0.1:8181/examples/default/examples#database_examples</a>
</li>
<li>The default configuration of web2py uses the SQLite database engine
</li>
<li>Our implementation also utilises the PostgreSQL database which should be installed separately
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Design the database and interface</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Create a new database</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>create a new postgres database using the following  code
</li>
</ul>




<pre class="src src-sh">sudo su
su - postgres 
createdb data_inventory
psql -d data_inventory
CREATE ROLE w2p_user LOGIN PASSWORD <span style="color: #2aa198;">'xpassword'</span>;
grant all on schema public to w2p_user;
\q
</pre>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Create a new web2py application</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>this will create a directory in the applications folder of the web2py home directory
</li>
</ul>




<pre class="src src-sh"><span style="color: #268bd2; font-style: italic;">cd</span> ~/tools/web2py 
python ./web2py.py -S data_inventory
</pre>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Set up database tables</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> relational model</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>The structure we decided on was that there would be ONE project TO MANY datasets, ONE dataset to MANY datatables, and ONE datatable TO MANY attributes/variables
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> defaults for models/db.py</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li>the database tables are set up in the models/db.py file that comes with default settings
</li>
<li>The first bit to change is the db reference from SQLite to postgres
</li>
<li>also note that "#if request.is_local else []" will allow using as a server
</li>
<li>Then add new table definitions down the bottom.  
</li>
<li>Here we added projects, datasets, datatables and attributes.
</li>
</ul>



</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> define our tables</h3>
<div class="outline-text-3" id="text-5-3">


</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> eml/title</h3>
<div class="outline-text-3" id="text-5-4">

<ul>
<li>eml-2.1.1/docs/eml-2.1.1/eml-project.html
</li>
<li>The EML Project module places the data into its larger research context. Suggested structure is: [geographic coverage] [data type]
</li>
<li><a href="./eml-2.1.1/docs/eml-2.1.1/eml-project.html#title">EML definition</a>
</li>
</ul>




</div>

</div>
