index.org
*** dataset

#+begin_src markdown :tangle ~/tools/web2py/applications/data_inventory/models/db.py :exports reports :eval no :padline no
  #### ONE (project) TO MANY (dataset)
  
  db.define_table(
      'dataset',
      Field('project_id',db.project),
      Field('ltern_id','integer'),
      Field('title','string', comment='Suggested structure is: [umbrella project] [data type] [geographic coverage] [temporal coverage]'),
      Field('contact','string', comment = 'Compulsory'),
      Field('creator','string', comment='The name of the person, organization, or position who created the data'),
      Field('abstract','string'),
      Field('intellectualrights','string'),
      Field('pubdate','date'),
      Field('geographicdescription','string'),
      Field('boundingcoordinates','string'),
      Field('temporalcoverage','string'),
      Field('metadataprovider','string'),
      Field('tern_contract_type','string'),
      format = '%(title)s'
      )
  
  db.dataset.contact.requires = [IS_EMAIL()]
    
  # db.dataset.metadataprovider.requires = [IS_EMAIL(), IS_NOT_IN_DB(db, 'dataset.metadataprovider')]
     
#+end_src

*** old dataset
#+begin_src markdown :tangle no :exports reports :eval no :padline no
  
  #### ONE (project) TO MANY (dataset)
  
  db.define_table(
      'dataset',
      Field('project_id',db.project),
      Field('title','string'),
      Field('creator', 'string'),
      Field('contact','string'),
      Field('intellectualrights','string'),
      Field('pubdate','date'),
      Field('geographicdescription','string'),
      Field('temporalcoverage','string'),
      Field('metadataprovider','string'),
      format = '%(title)s'
      )

  db.dataset.metadataprovider.requires = [IS_EMAIL(), IS_NOT_IN_DB(db, 'dataset.metadataprovider')]

#+end_src
*** datatable
#+begin_src markdown :tangle ~/tools/web2py/applications/data_inventory/models/db.py :exports reports :eval no :padline no
    
  #### ONE (dataset) TO MANY (datatables)
  
  db.define_table(
      'datatable',
      Field('dataset_id',db.dataset),
      Field('entityname','string'),
      Field('entitydescription', 'text')
      )
#+end_src
*** attribute
#+begin_src markdown :tangle ~/tools/web2py/applications/data_inventory/models/db.py :exports reports :eval no :padline no
  
  #### ONE (datatable) TO MANY (attributes/variables)
  
  db.define_table(
      'attributelist',
      Field('datatable_id',db.datatable),
      Field('name','string'),
      Field('definition', 'string')
      )
#+end_src
*** accessor
#+begin_src markdown :tangle ~/tools/web2py/applications/data_inventory/models/db.py :exports reports :eval no :padline no
  
  #### accessors
  
  db.define_table(
      'accessor',
      Field('name'),
      Field('email'),
      format = '%(email)s'
      )
  
  db.accessor.name.requires = IS_NOT_EMPTY()
  db.accessor.email.requires = [IS_EMAIL(), IS_NOT_IN_DB(db, 'accessor.email')]
  
#+end_src
*** access
#+begin_src markdown :tangle ~/tools/web2py/applications/data_inventory/models/db.py :exports reports :eval no :padline no
  
  #### MANY (datasets) TO MANY (accessors)
  
  db.define_table(
      'accessrequest',
      Field('dataset_id',db.dataset),
      Field('accessor_id',db.accessor),
      Field('title', 'string'),
      format = '%(title)s %(accessor_id)s -> %(dataset_id)s'
      )
    
#+end_src
*** keywords
#+begin_src markdown :tangle ~/tools/web2py/applications/data_inventory/models/db.py :exports reports :eval no :padline no
  
  #### MANY (keywords) TO one (dataset)
  
  db.define_table(
      'keyword',
      Field('dataset_id',db.dataset),
      Field('thesaurus', 'string', comment = 'source of authoritative definitions'),
      Field('keyword', 'string')
      )
    
#+end_src
