static/index.html

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> dataset</h3>
<div class="outline-text-3" id="text-5-5">





<pre class="src src-markdown"><span style="color: #268bd2; font-weight: bold;">####</span> <span style="color: #268bd2; font-weight: bold;">ONE (project) TO MANY (dataset)</span>

db.define_table(
<span style="color: #268bd2; font-weight: bold;">    'dataset',</span>
<span style="color: #268bd2; font-weight: bold;">    Field('project_id',db.project),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('ltern_id','integer'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('title','string', comment='Suggested structure is: </span><span style="color: #859900; font-weight: bold;">[umbrella project]</span><span style="color: #268bd2; font-weight: bold;"> </span><span style="color: #b58900;">[data type]</span><span style="color: #268bd2; font-weight: bold;"> </span><span style="color: #859900; font-weight: bold;">[geographic coverage]</span><span style="color: #268bd2; font-weight: bold;"> </span><span style="color: #b58900;">[temporal coverage]</span><span style="color: #268bd2; font-weight: bold;">'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('contact','string', comment = 'Compulsory'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('creator','string', comment='The name of the person, organization, or position who created the data'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('abstract','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('intellectualrights','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('pubdate','date'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('geographicdescription','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('boundingcoordinates','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('temporalcoverage','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('metadataprovider','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('tern_contract_type','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    format = '%(title)s'</span>
<span style="color: #268bd2; font-weight: bold;">    )</span>

db.dataset.contact.requires = [IS_EMAIL()]
  
<span style="color: #268bd2; font-weight: bold;">#</span> <span style="color: #268bd2; font-weight: bold;">db.dataset.metadataprovider.requires = [IS_EMAIL(), IS_NOT_IN_DB(db, 'dataset.metadataprovider')]</span>
   
</pre>


</div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> old dataset</h3>
<div class="outline-text-3" id="text-5-6">




<pre class="src src-markdown"><span style="color: #268bd2; font-weight: bold;">####</span> <span style="color: #268bd2; font-weight: bold;">ONE (project) TO MANY (dataset)</span>

db.define_table(
<span style="color: #268bd2; font-weight: bold;">    'dataset',</span>
<span style="color: #268bd2; font-weight: bold;">    Field('project_id',db.project),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('title','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('creator', 'string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('contact','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('intellectualrights','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('pubdate','date'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('geographicdescription','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('temporalcoverage','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('metadataprovider','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    format = '%(title)s'</span>
<span style="color: #268bd2; font-weight: bold;">    )</span>

db.dataset.metadataprovider.requires = [IS<span style="color: #268bd2; font-style: italic;">_EMAIL(), IS_</span>NOT<span style="color: #268bd2; font-style: italic;">_IN_</span>DB(db, 'dataset.metadataprovider')]

</pre>

</div>

</div>

<div id="outline-container-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> datatable</h3>
<div class="outline-text-3" id="text-5-7">




<pre class="src src-markdown">  
<span style="color: #268bd2; font-weight: bold;">####</span> <span style="color: #268bd2; font-weight: bold;">ONE (dataset) TO MANY (datatables)</span>

db.define_table(
<span style="color: #268bd2; font-weight: bold;">    'datatable',</span>
<span style="color: #268bd2; font-weight: bold;">    Field('dataset_id',db.dataset),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('entityname','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('entitydescription', 'text')</span>
<span style="color: #268bd2; font-weight: bold;">    )</span>
</pre>

</div>

</div>

<div id="outline-container-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> attribute</h3>
<div class="outline-text-3" id="text-5-8">




<pre class="src src-markdown"><span style="color: #268bd2; font-weight: bold;">####</span> <span style="color: #268bd2; font-weight: bold;">ONE (datatable) TO MANY (attributes/variables)</span>

db.define_table(
<span style="color: #268bd2; font-weight: bold;">    'attributelist',</span>
<span style="color: #268bd2; font-weight: bold;">    Field('datatable_id',db.datatable),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('name','string'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('definition', 'string')</span>
<span style="color: #268bd2; font-weight: bold;">    )</span>
</pre>

</div>

</div>

<div id="outline-container-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> accessor</h3>
<div class="outline-text-3" id="text-5-9">




<pre class="src src-markdown"><span style="color: #268bd2; font-weight: bold;">####</span> <span style="color: #268bd2; font-weight: bold;">accessors</span>

db.define_table(
<span style="color: #268bd2; font-weight: bold;">    'accessor',</span>
<span style="color: #268bd2; font-weight: bold;">    Field('name'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('email'),</span>
<span style="color: #268bd2; font-weight: bold;">    format = '%(email)s'</span>
<span style="color: #268bd2; font-weight: bold;">    )</span>

db.accessor.name.requires = IS<span style="color: #268bd2; font-style: italic;">_NOT_</span>EMPTY()
db.accessor.email.requires = [IS<span style="color: #268bd2; font-style: italic;">_EMAIL(), IS_</span>NOT<span style="color: #268bd2; font-style: italic;">_IN_</span>DB(db, 'accessor.email')]

</pre>

</div>

</div>

<div id="outline-container-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> access</h3>
<div class="outline-text-3" id="text-5-10">




<pre class="src src-markdown"><span style="color: #268bd2; font-weight: bold;">####</span> <span style="color: #268bd2; font-weight: bold;">MANY (datasets) TO MANY (accessors)</span>

db.define_table(
<span style="color: #268bd2; font-weight: bold;">    'accessrequest',</span>
<span style="color: #268bd2; font-weight: bold;">    Field('dataset_id',db.dataset),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('accessor_id',db.accessor),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('title', 'string'),</span>
<span style="color: #268bd2; font-weight: bold;">    format = '%(title)s %(accessor_id)s -&gt; %(dataset_id)s'</span>
<span style="color: #268bd2; font-weight: bold;">    )</span>
<span style="color: #268bd2; font-weight: bold;">  </span>
</pre>

</div>

</div>

<div id="outline-container-5-11" class="outline-3">
<h3 id="sec-5-11"><span class="section-number-3">5.11</span> keywords</h3>
<div class="outline-text-3" id="text-5-11">




<pre class="src src-markdown"><span style="color: #268bd2; font-weight: bold;">####</span> <span style="color: #268bd2; font-weight: bold;">MANY (keywords) TO one (dataset)</span>

db.define_table(
<span style="color: #268bd2; font-weight: bold;">    'keyword',</span>
<span style="color: #268bd2; font-weight: bold;">    Field('dataset_id',db.dataset),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('thesaurus', 'string', comment = 'source of authoritative definitions'),</span>
<span style="color: #268bd2; font-weight: bold;">    Field('keyword', 'string')</span>
<span style="color: #268bd2; font-weight: bold;">    )</span>
<span style="color: #268bd2; font-weight: bold;">  </span>
</pre>

</div>

</div>
