static/index.html

<div id="outline-container-5-12" class="outline-3">
<h3 id="sec-5-12"><span class="section-number-3">5.12</span> checklists</h3>
<div class="outline-text-3" id="text-5-12">




<pre class="src src-markdown"><span style="color: #268bd2; font-weight: bold;">####</span> <span style="color: #268bd2; font-weight: bold;">ONE (checklist) TO one (dataset)</span>
db.define<span style="color: #268bd2; font-style: italic;">_table(</span>
<span style="color: #268bd2; font-style: italic;">    'checklist',</span>
<span style="color: #268bd2; font-style: italic;">    Field('dataset_</span>id',db.dataset),
Field('checked<span style="color: #268bd2; font-style: italic;">_by','string'),</span>
<span style="color: #268bd2; font-style: italic;">Field('check_</span>date','date'),
Field('notes<span style="color: #268bd2; font-style: italic;">_comments','text'),</span>
<span style="color: #268bd2; font-style: italic;">Field('data_</span>package<span style="color: #268bd2; font-style: italic;">_title_</span>check','boolean'),
Field('data<span style="color: #268bd2; font-style: italic;">_set_</span>citation<span style="color: #268bd2; font-style: italic;">_check','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('data_</span>package<span style="color: #268bd2; font-style: italic;">_owner_</span>check','boolean'),
Field('data<span style="color: #268bd2; font-style: italic;">_package_</span>owner<span style="color: #268bd2; font-style: italic;">_check_</span>individual<span style="color: #268bd2; font-style: italic;">_name','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('data_</span>package<span style="color: #268bd2; font-style: italic;">_owner_</span>check<span style="color: #268bd2; font-style: italic;">_position_</span>role','boolean'),
Field('data<span style="color: #268bd2; font-style: italic;">_package_</span>owner<span style="color: #268bd2; font-style: italic;">_check_</span>organization','boolean'),
Field('data<span style="color: #268bd2; font-style: italic;">_package_</span>owner<span style="color: #268bd2; font-style: italic;">_check_</span>address','boolean'),
Field('data<span style="color: #268bd2; font-style: italic;">_package_</span>owner<span style="color: #268bd2; font-style: italic;">_check_</span>phone','boolean'),
Field('data<span style="color: #268bd2; font-style: italic;">_package_</span>owner<span style="color: #268bd2; font-style: italic;">_check_</span>email<span style="color: #268bd2; font-style: italic;">_address','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('associated_</span>parties','boolean'),
Field('associated<span style="color: #268bd2; font-style: italic;">_parties_</span>individual<span style="color: #268bd2; font-style: italic;">_name','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('associated_</span>parties<span style="color: #268bd2; font-style: italic;">_position','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('associated_</span>parties<span style="color: #268bd2; font-style: italic;">_organization','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('associated_</span>parties<span style="color: #268bd2; font-style: italic;">_physical_</span>address','boolean'),
Field('associated<span style="color: #268bd2; font-style: italic;">_parties_</span>phone','boolean'),
Field('associated<span style="color: #268bd2; font-style: italic;">_parties_</span>email<span style="color: #268bd2; font-style: italic;">_address','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('abstract','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('keywords_</span>and<span style="color: #268bd2; font-style: italic;">_subject_</span>categories','boolean'),
Field('gcmd<span style="color: #268bd2; font-style: italic;">_science_</span>keywords','boolean'),
Field('anzsrc<span style="color: #268bd2; font-style: italic;">_for_</span>codes','boolean'),
Field('ltern<span style="color: #268bd2; font-style: italic;">_monitoring_</span>themes','boolean'),
Field('keywords<span style="color: #268bd2; font-style: italic;">_free_</span>text','boolean'),
Field('geographic<span style="color: #268bd2; font-style: italic;">_coverage','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('geographic_</span>description','boolean'),
Field('bounding<span style="color: #268bd2; font-style: italic;">_coordinates','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('temporal_</span>coverage','boolean'),
Field('contacts<span style="color: #268bd2; font-style: italic;">_individual_</span>names','boolean'),
Field('contacts<span style="color: #268bd2; font-style: italic;">_positions','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('contacts_</span>organizations','boolean'),
Field('contacts<span style="color: #268bd2; font-style: italic;">_addresses','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('contacts_</span>phone','boolean'),
Field('contacts<span style="color: #268bd2; font-style: italic;">_email_</span>addresses','boolean'),
Field('methods<span style="color: #268bd2; font-style: italic;">_and_</span>sampling<span style="color: #268bd2; font-style: italic;">_information','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('method_</span>step<span style="color: #268bd2; font-style: italic;">_titles','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('method_</span>step<span style="color: #268bd2; font-style: italic;">_description','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('instrumentation_</span>details','boolean'),
Field('sampling<span style="color: #268bd2; font-style: italic;">_area_</span>and<span style="color: #268bd2; font-style: italic;">_frequency','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('sampling_</span>description','boolean'),
Field('research<span style="color: #268bd2; font-style: italic;">_project_</span>title','boolean'),
Field('research<span style="color: #268bd2; font-style: italic;">_project_</span>funding<span style="color: #268bd2; font-style: italic;">_sources','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('research_</span>project<span style="color: #268bd2; font-style: italic;">_personnel_</span>information','boolean'),
Field('research<span style="color: #268bd2; font-style: italic;">_project_</span>individual<span style="color: #268bd2; font-style: italic;">_name','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('research_</span>project<span style="color: #268bd2; font-style: italic;">_position_</span>role','boolean'),
Field('research<span style="color: #268bd2; font-style: italic;">_project_</span>organization','boolean'),
Field('research<span style="color: #268bd2; font-style: italic;">_project_</span>address','boolean'),
Field('research<span style="color: #268bd2; font-style: italic;">_project_</span>phone','boolean'),
Field('research<span style="color: #268bd2; font-style: italic;">_project_</span>email<span style="color: #268bd2; font-style: italic;">_address','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('research_</span>project<span style="color: #268bd2; font-style: italic;">_role','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('additional_</span>metadata','boolean'),

Field('access_control','boolean'),

Field('usage<span style="color: #268bd2; font-style: italic;">_rights','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('special_</span>conditions','boolean'),
Field('datatable<span style="color: #268bd2; font-style: italic;">_metadata','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('homepage_</span>content','boolean'),
Field('eml<span style="color: #268bd2; font-style: italic;">_homepage_</span>links','boolean'),
Field('can<span style="color: #268bd2; font-style: italic;">_the_</span>plot<span style="color: #268bd2; font-style: italic;">_network_</span>or<span style="color: #268bd2; font-style: italic;">_data_</span>package<span style="color: #268bd2; font-style: italic;">_be_</span>filtered<span style="color: #268bd2; font-style: italic;">_in_</span>the<span style="color: #268bd2; font-style: italic;">_search_</span>bar<span style="color: #268bd2; font-style: italic;">_of_</span>the<span style="color: #268bd2; font-style: italic;">_portal','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('draft_</span>publication<span style="color: #268bd2; font-style: italic;">_checklist_</span>passed','boolean'),
Field('metacat<span style="color: #268bd2; font-style: italic;">_publication_</span>checklist<span style="color: #268bd2; font-style: italic;">_check_</span>public<span style="color: #268bd2; font-style: italic;">_or_</span>mediated<span style="color: #268bd2; font-style: italic;">_access','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('metacat_</span>publication<span style="color: #268bd2; font-style: italic;">_checklist_</span>add<span style="color: #268bd2; font-style: italic;">_publication_</span>date<span style="color: #268bd2; font-style: italic;">_to_</span>data<span style="color: #268bd2; font-style: italic;">_inventory','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('metacat_</span>publication<span style="color: #268bd2; font-style: italic;">_checklist_</span>passed','boolean'),
Field('reporting<span style="color: #268bd2; font-style: italic;">_checklist_</span>licenced','boolean'),
Field('reporting<span style="color: #268bd2; font-style: italic;">_checklist_</span>described<span style="color: #268bd2; font-style: italic;">_with_</span>metadata<span style="color: #268bd2; font-style: italic;">_','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('reporting_</span>checklist<span style="color: #268bd2; font-style: italic;">_doi_</span>minted','boolean'),
Field('reporting<span style="color: #268bd2; font-style: italic;">_checklist_</span>metadata<span style="color: #268bd2; font-style: italic;">_feed_</span>to<span style="color: #268bd2; font-style: italic;">_tddp_</span>and<span style="color: #268bd2; font-style: italic;">_rda','boolean'),</span>
<span style="color: #268bd2; font-style: italic;">Field('reporting_</span>checklist<span style="color: #268bd2; font-style: italic;">_passed','boolean')</span>
<span style="color: #268bd2; font-style: italic;">    )</span>
<span style="color: #268bd2; font-style: italic;">    </span>
<span style="color: #268bd2; font-style: italic;">db.checklist.checked_</span>by.requires = IS<span style="color: #268bd2; font-style: italic;">_IN_</span>SET(['Claire', 'Karl'])
db.checklist.check<span style="color: #268bd2; font-style: italic;">_date.requires = IS_</span>NOT_EMPTY()
  
</pre>


</div>

</div>
