static/index.html

<div id="outline-container-5-13" class="outline-3">
<h3 id="sec-5-13"><span class="section-number-3">5.13</span> deeds</h3>
<div class="outline-text-3" id="text-5-13">




<pre class="src src-markdown">    
<span style="color: #268bd2; font-weight: bold;">####</span> <span style="color: #268bd2; font-weight: bold;">ONE (deed) TO one (dataset)</span>
db.define<span style="color: #268bd2; font-style: italic;">_table(</span>
<span style="color: #268bd2; font-style: italic;">    'deed',</span>
<span style="color: #268bd2; font-style: italic;">    Field('dataset_</span>id',db.dataset),
    Field('data<span style="color: #268bd2; font-style: italic;">_owner', 'string'),</span>
<span style="color: #268bd2; font-style: italic;">    Field('special_</span>permissions', 'string'),
    Field('licence<span style="color: #268bd2; font-style: italic;">_code', 'string')</span>
<span style="color: #268bd2; font-style: italic;">    )</span>
<span style="color: #268bd2; font-style: italic;">    </span>
<span style="color: #268bd2; font-style: italic;">db.deed.data_</span>owner.requires = IS<span style="color: #268bd2; font-style: italic;">_NOT_</span>EMPTY()  <span style="color: #268bd2; font-weight: bold; text-decoration: underline;">  </span>
db.deed.licence<span style="color: #268bd2; font-style: italic;">_code.requires = IS_</span>IN_SET(['CCBY', 'TERN-BYNC', 'adhoc'])  <span style="color: #268bd2; font-weight: bold; text-decoration: underline;">  </span>

</pre>


</div>

</div>

<div id="outline-container-5-14" class="outline-3">
<h3 id="sec-5-14"><span class="section-number-3">5.14</span> errata and addenda</h3>
<div class="outline-text-3" id="text-5-14">




<pre class="src src-markdown"><span style="color: #268bd2; font-weight: bold;">####</span> <span style="color: #268bd2; font-weight: bold;">ONE (errata_and_addenda) TO one (dataset)</span>
db.define<span style="color: #268bd2; font-style: italic;">_table(</span>
<span style="color: #268bd2; font-style: italic;">    'errata_</span>and<span style="color: #268bd2; font-style: italic;">_addenda',</span>
<span style="color: #268bd2; font-style: italic;">    Field('dataset_</span>id',db.dataset),
Field('logged<span style="color: #268bd2; font-style: italic;">_by','string'),</span>
<span style="color: #268bd2; font-style: italic;">Field('date_</span>logged','date'),
Field('date<span style="color: #268bd2; font-style: italic;">_actioned','date'),</span>
<span style="color: #268bd2; font-style: italic;">Field('errata','text'),</span>
<span style="color: #268bd2; font-style: italic;">Field('addenda','text')</span>
<span style="color: #268bd2; font-style: italic;">    )</span>
<span style="color: #268bd2; font-style: italic;">    </span>
<span style="color: #268bd2; font-style: italic;">db.errata_</span>and<span style="color: #268bd2; font-style: italic;">_addenda.logged_</span>by.requires = IS<span style="color: #268bd2; font-style: italic;">_NOT_</span>EMPTY()
db.errata<span style="color: #268bd2; font-style: italic;">_and_</span>addenda.date<span style="color: #268bd2; font-style: italic;">_logged.requires = IS_</span>NOT_EMPTY()  <span style="color: #268bd2; font-weight: bold; text-decoration: underline;">  </span>
</pre>

</div>

</div>

<div id="outline-container-5-15" class="outline-3">
<h3 id="sec-5-15"><span class="section-number-3">5.15</span> Defaults for controllers/default.py</h3>
<div class="outline-text-3" id="text-5-15">

<ul>
<li>Following the example in the documentation 
</li>
</ul>



</div>

</div>

<div id="outline-container-5-16" class="outline-3">
<h3 id="sec-5-16"><span class="section-number-3">5.16</span> Top Menu And Register Accessors</h3>
<div class="outline-text-3" id="text-5-16">

<ul>
<li>From example 30 we get a simple user registration form. SQLFORM takes a table and returns the corresponding entry form with validators, etc. 
</li>
<li>The response.menu on top is just a variable used by the layout to make the navigation menu for all functions in this controller.
</li>
</ul>




<pre class="src src-R">response.menu = [[<span style="color: #2aa198;">'Manage Projects'</span>, False, URL(<span style="color: #2aa198;">'manage_projects'</span>)],
                 [<span style="color: #2aa198;">'Manage Datasets'</span>, False, URL(<span style="color: #2aa198;">'manage_datasets'</span>)],
                 [<span style="color: #2aa198;">'Register Accessor'</span>, False, URL(<span style="color: #2aa198;">'register_accessor'</span>)],
                 [<span style="color: #2aa198;">'Access Dataset'</span>, False, URL(<span style="color: #2aa198;">'access_dataset'</span>)]]

def register_accessor():
    <span style="color: #586e75;"># </span><span style="color: #586e75;">create an insert form from the table</span>
    form = SQLFORM(db.accessor).process()

    <span style="color: #586e75;"># </span><span style="color: #586e75;">if form correct perform the insert</span>
    <span style="color: #859900; font-weight: bold;">if</span> form.accepted:
        response.flash = <span style="color: #2aa198;">'new record inserted'</span>

    <span style="color: #586e75;"># </span><span style="color: #586e75;">and get a list of all persons</span>
    records = SQLTABLE(db().select(db.accessor.ALL),headers=<span style="color: #2aa198;">'fieldname:capitalize'</span>)

    <span style="color: #859900; font-weight: bold;">return</span> dict(form=form, records=records)

</pre>


</div>

</div>

<div id="outline-container-5-17" class="outline-3">
<h3 id="sec-5-17"><span class="section-number-3">5.17</span> Access a dataset</h3>
<div class="outline-text-3" id="text-5-17">

<ul>
<li>Modified Example 32 from a sophisticated form that  checks the accessor  and the dataset are in the database and updates the corresponding record or inserts a new access. This version just adds another access record for each request.
</li>
</ul>





<pre class="src src-R">def access_dataset():
    form = SQLFORM.factory(
        Field(<span style="color: #2aa198;">'accessor_id'</span>,requires=IS_IN_DB(db,db.accessor.id,<span style="color: #2aa198;">'%(email)s'</span>)),
        Field(<span style="color: #2aa198;">'dataset_id'</span>,requires=IS_IN_DB(db,db.dataset.id,<span style="color: #2aa198;">'%(title)s'</span>)),
        Field(<span style="color: #2aa198;">'title'</span>,<span style="color: #2aa198;">'string'</span>,requires=IS_NOT_EMPTY())).process()
    
    <span style="color: #859900; font-weight: bold;">if</span> form.accepted:
        <span style="color: #586e75;"># </span><span style="color: #586e75;">get previous access for same dataset</span>
        access = db((db.accessrequest.accessor_id == form.vars.accessor_id)&amp;
            (db.accessrequest.dataset_id==form.vars.dataset_id)).select().first()

        db.accessrequest.insert(accessor_id=form.vars.accessor_id,
                         dataset_id=form.vars.dataset_id,
                         title=form.vars.title)

        response.flash = <span style="color: #2aa198;">'dataset accessed!'</span>
    elif form.errors:
        response.flash = <span style="color: #2aa198;">'invalid values in form!'</span>

    
    <span style="color: #586e75;"># </span><span style="color: #586e75;">now get a list of all purchases</span>
    accessing = (db.accessor.id==db.accessrequest.accessor_id)&amp;(db.dataset.id==db.accessrequest.dataset_id)
    records = SQLTABLE(db(accessing).select(),headers=<span style="color: #2aa198;">'fieldname:capitalize'</span>)
    <span style="color: #859900; font-weight: bold;">return</span> dict(form=form, records=records)


</pre>


</div>

</div>
