index.org
** COMMENT Access a dataset
- Example 32 is a rather sophisticated buy form. It checks that the buyer and the product are in the database and updates the corresponding record or inserts a new purchase. It also does a JOIN to list all purchases. 
# controllers/forms.py
#+begin_src R :session *R* :tangle no :exports reports :eval no :padline no
  def access_dataset():
      form = SQLFORM.factory(
          Field('accessor_id',requires=IS_IN_DB(db,db.accessor.id,'%(email)s')),
          Field('dataset_id',requires=IS_IN_DB(db,db.dataset.id,'%(title)s')),
          Field('title','string',requires=IS_NOT_EMPTY())).process()
      if form.accepted:
          # get previous access for same dataset
          access = db((db.access.accessor_id == form.vars.accessor_id)&
              (db.access.dataset_id==form.vars.dataset_id)).select().first()
  
          if access:
              # if list contains a record, update that record
              access.update_record(
                  title = form.vars.title)
          else:
              # self insert a new record in table
              db.access.insert(accessor_id=form.vars.accessor_id,
                               dataset_id=form.vars.dataset_id,
                               title=form.vars.title)
          response.flash = 'dataset accessed!'
      elif form.errors:
          response.flash = 'invalid values in form!'
  
      
      # now get a list of all purchases
      accessing = (db.accessor.id==db.access.accessor_id)&(db.dataset.id==db.access.dataset_id)
      records = SQLTABLE(db(accessing).select(),headers='fieldname:capitalize')
      return dict(form=form, records=records)
  
#+end_src
** Register access view
#+begin_src R :session *R* :tangle ~/tools/web2py/applications/data_inventory/views/forms/access_dataset.html :exports reports :eval no :padline no
  
  {{extend 'layout.html'}}
  <h1>Access form</h1>
    {{=form}}
    [ {{=A('delete accesses',_href=URL('delete_accessed'))}} ]
    <h2>Current access (SQL JOIN!)</h2>
  <p>{{=records}}</p>
  
  
#+end_src

** Main form ties it all together
#+begin_src R :session *R* :tangle ~/tools/web2py/applications/data_inventory/controllers/forms.py :exports reports :eval no :padline no
  
  def manage_projects():
      grid = SQLFORM.smartgrid(db.project,linked_tables=['dataset', 'datatable', 'attributelist','accessrequest',  'errata_and_addenda',
                                                        'checklist','deed'],
                               fields = [db.project.title,db.project.id,
                                         db.dataset.title, db.dataset.ltern_id,db.dataset.tern_contract_type,
                                         db.datatable.entityname,
                                         db.attributelist.name, db.attributelist.definition,
                                         db.accessrequest.accessor_id, db.accessrequest.dataset_id,
                                         db.accessrequest.title, 
                                         db.errata_and_addenda.logged_by, db.errata_and_addenda.date_logged,
                                         db.checklist.checked_by, db.checklist.check_date, 
                                         db.checklist.draft_publication_checklist_passed, db.checklist.reporting_checklist_passed, 
                                         db.deed.data_owner],
                                         orderby = dict(project=db.project.id, dataset=db.dataset.title),
                               user_signature=True,maxtextlength =200)
      return dict(grid=grid)
#+end_src  
** COMMENT deprecated manageproj-code
#+name:deprecated manageproj
#+begin_src R :session *R* :tangle no :exports none :eval no
  #### name:deprecated manageproj####

  def manage_projects():
      grid = SQLFORM.smartgrid(db.project,linked_tables=['dataset', 'datatable', 'attributelist','accessrequest', 'keyword'],
                               fields = [db.project.title,
                                         db.dataset.title, db.dataset.creator,
                                         db.datatable.entityname,
                                         db.attributelist.name, db.attributelist.definition,
                                         db.accessrequest.accessor_id, db.accessrequest.dataset_id,
                                         db.accessrequest.title, 
                                         db.keyword.thesaurus, db.keyword.keyword],
                               user_signature=True,maxtextlength =200)
      return dict(grid=grid)
  
#+end_src

** Form to manage all datasets
#+name:manage datasets
#+begin_src R :session *R* :tangle ~/tools/web2py/applications/data_inventory/controllers/forms.py :exports reports :eval no :padline no
  
  def manage_datasets():
      grid = SQLFORM.smartgrid(db.dataset,linked_tables=['project', 'datatable', 'attributelist','accessrequest', 'errata_and_addenda', 
                                                         'checklist','deed'],
                               fields = [db.dataset.project_id,
                                         db.dataset.title, db.dataset.ltern_id,db.dataset.tern_contract_type,
                                         db.datatable.entityname,
                                         db.attributelist.name, db.attributelist.definition,
                                         db.accessrequest.accessor_id, db.accessrequest.dataset_id,
                                         db.accessrequest.title, 
                                         db.errata_and_addenda.logged_by, db.errata_and_addenda.date_logged,
                                         db.checklist.checked_by, db.checklist.check_date, 
                                         db.checklist.draft_publication_checklist_passed, db.checklist.reporting_checklist_passed, 
                                         db.deed.data_owner],
                                         orderby = dict(dataset=[db.dataset.project_id,db.dataset.title]),
                               user_signature=True,maxtextlength =200)
      return dict(grid=grid)
  
#+end_src

** finesse the interface
- the following makes a home page
- also go to static/css/web2py.css and change line 33/34 text width to about 800px
#+begin_src markdown :tangle ~/tools/web2py/applications/data_inventory/views/default/index.html :exports reports :eval no :padline
  {{left_sidebar_enabled,right_sidebar_enabled=False,('message' in globals())}}
  {{extend 'layout.html'}}
  
  {{if 'message' in globals():}}
  <h3>{{=message}}</h3>
  
  <h4>{{=T('Instructions')}}</h4>
  <ol>
    <li>{{=T('You are using the data inventory')}}</li>
    <li>{{=XML(T('The main tool for managing research projects (umbrella grouping of packages) is at %s',
             A('%(application)s/forms/manage_projects/'%request,
             _href=URL('forms','manage_projects'))))}}</li>
    <li>{{=XML(T('The main tool for managing datasets (packages) is at %s',
             A('%(application)s/forms/manage_datasets/'%request,
             _href=URL('forms','manage_datasets'))))}}</li>
    <li>{{=XML(T('The technical documentation for this application is at %s',
             A('this link',
             _href=URL('static','index.html'))))}}</li>  
  </ol>
  {{elif 'content' in globals():}}
  {{=content}}
  {{else:}}
  {{=BEAUTIFY(response._vars)}}
  {{pass}}
  
  {{block right_sidebar}}
  {{=A(T("Administrative Interface"), _href=URL('admin','default','index'), _class='btn',
       _style='margin-top: 1em;')}}
  {{end}}
  
#+end_src

* COMMENT migrate DDI R Code
** COMMENT load data-code
#+name:load data
#+begin_src R :session *R* :tangle no :exports none :eval no
  #### name:load data####
  library(swishdbtools)
  ch <- connect2postgres2("data_inventory2")
  
  pgListTables(ch, "public")
  
  indir <- "~/Dropbox/projects/0.3 Catalogue/backups/csvs/2014-04-15"
  dir(indir)
  dat <- read.csv(file.path(indir, "STDYDSCR_edit.csv"))
  str(dat)
  dbWriteTable(ch, "stdydscr", dat)
  
  names(table(dat$IDNO))
  names(table(dat$AUTHENTY))
  names(table(dat$DISTRBTR))
  
  
  stdy <- dat[grep("ECOR", dat$IDNO),]
  t(stdy[,1:25])
  matrix(names(stdy))
  
  
  
  dat <- read.csv(file.path(indir, "FILEDSCR.csv"))
  str(dat)
  names(table(dat$IDNO))
  dat[grep("mesic", dat$FILENAME),]
  
  file <- dat[grep("ECOR", dat$IDNO),]
  file
  
#+end_src

* COMMENT DEPRECATED old crap
