static/index.html

<div id="outline-container-5-18" class="outline-3">
<h3 id="sec-5-18"><span class="section-number-3">5.18</span> Register access view</h3>
<div class="outline-text-3" id="text-5-18">




<pre class="src src-R">{{extend <span style="color: #2aa198;">'layout.html'</span>}}
&lt;h1&gt;Access form&lt;/h1&gt;
  {{=form}}
  [ {{=A(<span style="color: #2aa198;">'delete accesses'</span>,_href=URL(<span style="color: #2aa198;">'delete_accessed'</span>))}} ]
  &lt;h2&gt;Current access (SQL JOIN!)&lt;/h2&gt;
&lt;p&gt;{{=records}}&lt;/p&gt;


</pre>


</div>

</div>

<div id="outline-container-5-19" class="outline-3">
<h3 id="sec-5-19"><span class="section-number-3">5.19</span> Main form ties it all together</h3>
<div class="outline-text-3" id="text-5-19">




<pre class="src src-R">def manage_projects():
    grid = SQLFORM.smartgrid(db.project,linked_tables=[<span style="color: #2aa198;">'dataset'</span>, <span style="color: #2aa198;">'datatable'</span>, <span style="color: #2aa198;">'attributelist'</span>,<span style="color: #2aa198;">'accessrequest'</span>,  <span style="color: #2aa198;">'errata_and_addenda'</span>,
                                                      <span style="color: #2aa198;">'checklist'</span>,<span style="color: #2aa198;">'deed'</span>],
                             fields = [db.project.title,db.project.id,
                                       db.dataset.title, db.dataset.ltern_id,db.dataset.tern_contract_type,
                                       db.datatable.entityname,
                                       db.attributelist.name, db.attributelist.definition,
                                       db.accessrequest.accessor_id, db.accessrequest.dataset_id,
                                       db.accessrequest.title, 
                                       db.errata_and_addenda.logged_by, db.errata_and_addenda.date_logged,
                                       db.checklist.checked_by, db.checklist.check_date, 
                                       db.checklist.draft_publication_checklist_passed, db.checklist.reporting_checklist_passed, 
                                       db.deed.data_owner],
                                       orderby = dict(project=db.project.id, dataset=db.dataset.title),
                             user_signature=True,maxtextlength =200)
    <span style="color: #859900; font-weight: bold;">return</span> dict(grid=grid)
</pre>



</div>

</div>

<div id="outline-container-5-20" class="outline-3">
<h3 id="sec-5-20"><span class="section-number-3">5.20</span> Form to manage all datasets</h3>
<div class="outline-text-3" id="text-5-20">




<pre class="src src-R">def manage_datasets():
    grid = SQLFORM.smartgrid(db.dataset,linked_tables=[<span style="color: #2aa198;">'project'</span>, <span style="color: #2aa198;">'datatable'</span>, <span style="color: #2aa198;">'attributelist'</span>,<span style="color: #2aa198;">'accessrequest'</span>, <span style="color: #2aa198;">'errata_and_addenda'</span>, 
                                                       <span style="color: #2aa198;">'checklist'</span>,<span style="color: #2aa198;">'deed'</span>],
                             fields = [db.dataset.project_id,
                                       db.dataset.title, db.dataset.ltern_id,db.dataset.tern_contract_type,
                                       db.datatable.entityname,
                                       db.attributelist.name, db.attributelist.definition,
                                       db.accessrequest.accessor_id, db.accessrequest.dataset_id,
                                       db.accessrequest.title, 
                                       db.errata_and_addenda.logged_by, db.errata_and_addenda.date_logged,
                                       db.checklist.checked_by, db.checklist.check_date, 
                                       db.checklist.draft_publication_checklist_passed, db.checklist.reporting_checklist_passed, 
                                       db.deed.data_owner],
                                       orderby = dict(dataset=[db.dataset.project_id,db.dataset.title]),
                             user_signature=True,maxtextlength =200)
    <span style="color: #859900; font-weight: bold;">return</span> dict(grid=grid)

</pre>


</div>

</div>

<div id="outline-container-5-21" class="outline-3">
<h3 id="sec-5-21"><span class="section-number-3">5.21</span> finesse the interface</h3>
<div class="outline-text-3" id="text-5-21">

<ul>
<li>the following makes a home page
</li>
<li>also go to static/css/web2py.css and change line 33/34 text width to about 800px
</li>
</ul>




<pre class="src src-markdown">{{left<span style="color: #268bd2; font-style: italic;">_sidebar_</span>enabled,right<span style="color: #268bd2; font-style: italic;">_sidebar_</span>enabled=False,('message' in globals())}}
{{extend 'layout.html'}}

{{if 'message' in globals():}}
&lt;h3&gt;{{=message}}&lt;/h3&gt;

&lt;h4&gt;{{=T('Instructions')}}&lt;/h4&gt;
&lt;ol&gt;
  &lt;li&gt;{{=T('You are using the data inventory')}}&lt;/li&gt;
  &lt;li&gt;{{=XML(T('The main tool for managing research projects (umbrella grouping of packages) is at %s',
           A('%(application)s/forms/manage<span style="color: #268bd2; font-style: italic;">_projects/'%request,</span>
<span style="color: #268bd2; font-style: italic;">           _href=URL('forms','manage_</span>projects'))))}}&lt;/li&gt;
  &lt;li&gt;{{=XML(T('The main tool for managing datasets (packages) is at %s',
           A('%(application)s/forms/manage<span style="color: #268bd2; font-style: italic;">_datasets/'%request,</span>
<span style="color: #268bd2; font-style: italic;">           _href=URL('forms','manage_</span>datasets'))))}}&lt;/li&gt;
  &lt;li&gt;{{=XML(T('The technical documentation for this application is at %s',
           A('this link',
           _href=URL('static','index.html'))))}}&lt;/li&gt;<span style="color: #268bd2; font-weight: bold; text-decoration: underline;">  </span>
&lt;/ol&gt;
{{elif 'content' in globals():}}
{{=content}}
{{else:}}
{{=BEAUTIFY(response._vars)}}
{{pass}}

{{block right_sidebar}}
{{=A(T("Administrative Interface"), _href=URL('admin','default','index'), _class='btn',
     _style='margin-top: 1em;')}}
{{end}}

</pre>





</div>
</div>
</div>
</div>

</body>
</html>
